/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nkannan <nkannan@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/21 15:22:31 by nkannan           #+#    #+#             */
/*   Updated: 2023/05/21 15:23:11 by nkannan          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// 指定されたファイルディスクリプタfdで文字cを出力

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
